---
kind: type
id: T:Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions
source: html/20934444-987d-1169-1619-2adb54377e7d.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions

Options for FabricationPart.SaveAsFabricationJob() method.

## Syntax (C#)
```csharp
public class FabricationSaveJobOptions : IDisposable
```